; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	)
(:init
	(at plane1 city7)
	(= (capacity plane1) 14845)
	(= (fuel plane1) 673)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 12)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at plane2 city4)
	(= (capacity plane2) 2930)
	(= (fuel plane2) 116)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 3)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city2)
	(= (capacity plane3) 2125)
	(= (fuel plane3) 60)
	(= (slow-burn plane3) 1)
	(= (fast-burn plane3) 2)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 4)
	(at person1 city4)
	(at person2 city3)
	(at person3 city5)
	(at person4 city0)
	(at person5 city4)
	(at person6 city2)
	(at person7 city4)
	(at person8 city6)
	(at person9 city6)
	(at person10 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 755)
	(= (distance city0 city2) 969)
	(= (distance city0 city3) 746)
	(= (distance city0 city4) 953)
	(= (distance city0 city5) 566)
	(= (distance city0 city6) 930)
	(= (distance city0 city7) 858)
	(= (distance city0 city8) 684)
	(= (distance city0 city9) 857)
	(= (distance city1 city0) 755)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 914)
	(= (distance city1 city3) 866)
	(= (distance city1 city4) 789)
	(= (distance city1 city5) 735)
	(= (distance city1 city6) 827)
	(= (distance city1 city7) 639)
	(= (distance city1 city8) 594)
	(= (distance city1 city9) 582)
	(= (distance city2 city0) 969)
	(= (distance city2 city1) 914)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 928)
	(= (distance city2 city4) 801)
	(= (distance city2 city5) 527)
	(= (distance city2 city6) 901)
	(= (distance city2 city7) 544)
	(= (distance city2 city8) 683)
	(= (distance city2 city9) 745)
	(= (distance city3 city0) 746)
	(= (distance city3 city1) 866)
	(= (distance city3 city2) 928)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 517)
	(= (distance city3 city5) 625)
	(= (distance city3 city6) 703)
	(= (distance city3 city7) 880)
	(= (distance city3 city8) 954)
	(= (distance city3 city9) 910)
	(= (distance city4 city0) 953)
	(= (distance city4 city1) 789)
	(= (distance city4 city2) 801)
	(= (distance city4 city3) 517)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 904)
	(= (distance city4 city6) 710)
	(= (distance city4 city7) 880)
	(= (distance city4 city8) 651)
	(= (distance city4 city9) 663)
	(= (distance city5 city0) 566)
	(= (distance city5 city1) 735)
	(= (distance city5 city2) 527)
	(= (distance city5 city3) 625)
	(= (distance city5 city4) 904)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 946)
	(= (distance city5 city7) 582)
	(= (distance city5 city8) 522)
	(= (distance city5 city9) 630)
	(= (distance city6 city0) 930)
	(= (distance city6 city1) 827)
	(= (distance city6 city2) 901)
	(= (distance city6 city3) 703)
	(= (distance city6 city4) 710)
	(= (distance city6 city5) 946)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 939)
	(= (distance city6 city8) 936)
	(= (distance city6 city9) 997)
	(= (distance city7 city0) 858)
	(= (distance city7 city1) 639)
	(= (distance city7 city2) 544)
	(= (distance city7 city3) 880)
	(= (distance city7 city4) 880)
	(= (distance city7 city5) 582)
	(= (distance city7 city6) 939)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 729)
	(= (distance city7 city9) 671)
	(= (distance city8 city0) 684)
	(= (distance city8 city1) 594)
	(= (distance city8 city2) 683)
	(= (distance city8 city3) 954)
	(= (distance city8 city4) 651)
	(= (distance city8 city5) 522)
	(= (distance city8 city6) 936)
	(= (distance city8 city7) 729)
	(= (distance city8 city8) 0)
	(= (distance city8 city9) 824)
	(= (distance city9 city0) 857)
	(= (distance city9 city1) 582)
	(= (distance city9 city2) 745)
	(= (distance city9 city3) 910)
	(= (distance city9 city4) 663)
	(= (distance city9 city5) 630)
	(= (distance city9 city6) 997)
	(= (distance city9 city7) 671)
	(= (distance city9 city8) 824)
	(= (distance city9 city9) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city2)
	(at plane3 city1)
	(at person1 city9)
	(at person2 city3)
	(at person3 city2)
	(at person4 city5)
	(at person5 city6)
	(at person6 city5)
	(at person7 city3)
	(at person9 city3)
	))

(:metric minimize (+ (* 3 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane2 city4)
   changed: (fuel plane2) from 116 to 2930
   goals met: 1 of 10
2. (board person1 plane2 city4)
   deleted: (at person1 city4)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 10
3. (fly plane2 city4 city2)
   deleted: (at plane2 city4)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 0 to 801, (fuel plane2) from 2930 to 2129
   goals met: 2 of 10
4. (board person6 plane2 city2)
   deleted: (at person6 city2)
   added: (in person6 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 2 of 10
5. (fly plane2 city2 city9)
   deleted: (at plane2 city2)
   added: (at plane2 city9)
   changed: (total-fuel-used) from 801 to 1546, (fuel plane2) from 2129 to 1384
   goals met: 1 of 10
6. (debark person1 plane2 city9)
   deleted: (in person1 plane2)
   added: (at person1 city9)
   changed: (onboard plane2) from 2 to 1
   goals met: 2 of 10
7. (fly plane2 city9 city5)
   deleted: (at plane2 city9)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 1546 to 2176, (fuel plane2) from 1384 to 754
   goals met: 2 of 10
8. (debark person6 plane2 city5)
   deleted: (in person6 plane2)
   added: (at person6 city5)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 10
9. (board person3 plane2 city5)
   deleted: (at person3 city5)
   added: (in person3 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 3 of 10
10. (refuel plane3 city2)
   changed: (fuel plane3) from 60 to 2125
   goals met: 3 of 10
11. (fly plane2 city5 city2)
   deleted: (at plane2 city5)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 2176 to 2703, (fuel plane2) from 754 to 227
   goals met: 4 of 10
12. (fly plane3 city2 city5)
   deleted: (at plane3 city2)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 2703 to 3230, (fuel plane3) from 2125 to 1598
   goals met: 4 of 10
13. (debark person3 plane2 city2)
   deleted: (in person3 plane2)
   added: (at person3 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 5 of 10
14. (fly plane3 city5 city0)
   deleted: (at plane3 city5)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 3230 to 3796, (fuel plane3) from 1598 to 1032
   goals met: 5 of 10
15. (board person4 plane3 city0)
   deleted: (at person4 city0)
   added: (in person4 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 5 of 10
16. (fly plane3 city0 city6)
   deleted: (at plane3 city0)
   added: (at plane3 city6)
   changed: (total-fuel-used) from 3796 to 4726, (fuel plane3) from 1032 to 102
   goals met: 5 of 10
17. (refuel plane3 city6)
   changed: (fuel plane3) from 102 to 2125
   goals met: 5 of 10
18. (board person9 plane3 city6)
   deleted: (at person9 city6)
   added: (in person9 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 5 of 10
19. (fly plane3 city6 city5)
   deleted: (at plane3 city6)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 4726 to 5672, (fuel plane3) from 2125 to 1179
   goals met: 5 of 10
20. (debark person4 plane3 city5)
   deleted: (in person4 plane3)
   added: (at person4 city5)
   changed: (onboard plane3) from 2 to 1
   goals met: 6 of 10
21. (fly plane3 city5 city3)
   deleted: (at plane3 city5)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 5672 to 6297, (fuel plane3) from 1179 to 554
   goals met: 6 of 10
22. (debark person9 plane3 city3)
   deleted: (in person9 plane3)
   added: (at person9 city3)
   changed: (onboard plane3) from 1 to 0
   goals met: 7 of 10
23. (refuel plane3 city3)
   changed: (fuel plane3) from 554 to 2125
   goals met: 7 of 10
24. (fly plane3 city3 city4)
   deleted: (at plane3 city3)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 6297 to 6814, (fuel plane3) from 2125 to 1608
   goals met: 7 of 10
25. (board person5 plane3 city4)
   deleted: (at person5 city4)
   added: (in person5 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 7 of 10
26. (board person7 plane3 city4)
   deleted: (at person7 city4)
   added: (in person7 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 7 of 10
27. (fly plane3 city4 city6)
   deleted: (at plane3 city4)
   added: (at plane3 city6)
   changed: (total-fuel-used) from 6814 to 7524, (fuel plane3) from 1608 to 898
   goals met: 7 of 10
28. (debark person5 plane3 city6)
   deleted: (in person5 plane3)
   added: (at person5 city6)
   changed: (onboard plane3) from 2 to 1
   goals met: 8 of 10
29. (fly plane3 city6 city1)
   deleted: (at plane3 city6)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 7524 to 8351, (fuel plane3) from 898 to 71
   goals met: 9 of 10
30. (refuel plane3 city1)
   changed: (fuel plane3) from 71 to 2125
   goals met: 9 of 10
31. (fly plane3 city1 city3)
   deleted: (at plane3 city1)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 8351 to 9217, (fuel plane3) from 2125 to 1259
   goals met: 8 of 10
32. (debark person7 plane3 city3)
   deleted: (in person7 plane3)
   added: (at person7 city3)
   changed: (onboard plane3) from 1 to 0
   goals met: 9 of 10
33. (fly plane3 city3 city1)
   deleted: (at plane3 city3)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 9217 to 10083, (fuel plane3) from 1259 to 393
   goals met: 10 of 10
